Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: གཙང་མའི་གོས་རྣམས་རབ་བགོས་ལ། །དྲི་ཞིམ་པ་ཡི་གོས་འཆང་ཞིང་། །བྱམས་པའི་སེམས་ནི་ཉེར་བཞག་ནས། །གཡེལ་བ་མེད་པས་མཆོད་པར་བྱ། །
en: “Having put on clean clothes, Wearing perfumed clothing, And having a loving mind, They should offer without distraction.

source: རང་གི་སེམས་ནི་དྲི་མེད་ཅིང་། །རྒྱ་ཆེ་བར་ཡང་རབ་བྱེད་ལ། །སེམས་ཀྱང་ཤིན་ཏུ་དང་བྱེད་ཀྱིས། །མདོ་སྡེའི་དམ་པ་མཉན་པར་གྱིས། །
en: “They should make their Own minds pure and vast, And with minds filled with faith, They should listen to this sublime sūtra.

source: གང་དག་མདོ་འདི་ཉན་པ་ནི། །དེ་དག་མི་ནང་ལེགས་པར་འོངས། །མི་ཡི་སྲིད་པ་ལེགས་པར་ཐོབ། །འཚོ་བ་བདེ་བས་འཚོ་བར་འགྱུར། །
en: “Those who listen to this sūtra Will be welcomed among humans, Will attain an excellent human existence, And will live happy lives.

source: གང་གི་རྣ་བའི་བུ་གར་ཡང་། །བཤད་པ་འདི་ནི་གྲག་གྱུར་པ། །དེ་དག་དགེ་རྩ་སྦྱངས་པ་སྟེ། །སངས་རྒྱས་མང་པོས་རབ་ཏུ་བསྔགས། །
en: “Those in whose ears This teaching sounds Will plant good roots And be praised by many buddhas.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས་གླེང་གཞིའི་ལེའུ་སྟེ་དང་པོའོ།། །།
en: This concludes “The Introduction,” the first chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཛེས་པའི་ཏོག་ཅེས་བྱ་བ།
en: Chapter 2: The Teaching of the Lifespan of the Tathāgata Also, at that time, there dwelled in the great city of Rājagṛha a bodhisattva mahāsattva by the name of Ruciraketu.

source: སྔོན་གྱི་རྒྱལ་བ་ལ་ལྷག་པར་བྱ་བ་བྱས་པ། དགེ་བའི་རྩ་བ་བསྐྱེད་པ། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་ལ་རིམ་གྲོ་བྱས་པ་ཞིག་གནས་པ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: He had served past jinas, had developed roots of merit, and had attended upon many hundreds of thousands of quintillions of buddhas.

source: རྒྱུ་གང་དང་རྐྱེན་གང་གིས། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་འདི་ལྟ་སྟེ། ལོ་བརྒྱད་ཅུ་ཞིག་ཐུབ་སྟེ། འདི་ལྟར་སྐུ་ཚེ་ཐུང་སྙམ་ནས།
en: He thought, “Through what causes and what conditions does the Bhagavat Śākyamuni have such a short lifespan of eighty years?”

source: དེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་འདི་སྐད་དུ། རྒྱུ་དང་རྐྱེན་གཉིས་ཀྱིས་ཚེ་རིང་བར་འགྱུར་ཏེ།
en: Then he thought, “The Bhagavat has said, ‘There are two causes and two conditions for a long life.

source: གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are those two?

source: སྲོག་གཅོད་པ་སྤངས་པ་དང་། ཁ་ཟས་རབ་ཏུ་སྦྱིན་པའོ། །ཞེས་གསུངས་ཏེ།
en: Forsaking killing and giving food.’

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ནི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་པ་མང་པོ་ནས། སྲོག་གཅོད་པ་སྤངས་པར་གྱུར་པ་ནས། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱི་བར་དུ་ཡང་དག་པར་བླངས་ཏེ་གནས་པར་གྱུར།
en: The Bhagavat Śākyamuni has forsaken killing and has correctly adopted the path of the ten good actions for countless hundreds of thousands of quintillions of eons.

source: ཁ་ཟས་ཀྱང་ཕྱི་ནང་གི་དངོས་པོ་རྣམས་སེམས་ཅན་དག་ལ་ཡོངས་སུ་བཏང་སྟེ། ཆེར་ན་རང་གི་ལུས་ཀྱི་ཤ་དང་། ཁྲག་དང་། རུས་པ་དང་། རྐང་གིས་ཀྱང་སེམས་ཅན་ལྟོགས་པ་རྣམས་ཚིམ་པར་མཛད་ན། ཟས་གཞན་གྱིས་ལྟ་ཅི་སྨོས་སྙམ་མོ། །
en: He has given external and internal substances as food to beings, even to the extent of satisfying hungry beings with his own body, blood, bones, and limbs, to say nothing of every other kind of food.”

source: དེ་ནས་སྐྱེས་བུ་དམ་པ་དེས། སངས་རྒྱས་ལ་སོང་བའི་ཡིད་ལ་བྱེད་པ་དག་ལས་འདི་ལྟ་བུའི་ཚུལ་གྱི་བསམ་པ་འདི་དག་སེམས་པ་ན། དེའི་ཁྱིམ་ཡངས་ཤིང་རྒྱ་ཆེ་བ། བཻ་ཌཱུརྱ་སྔོན་པོ་ལས་གྲུབ་པ།
en: When that sublime being’s mind had thought that, with his attention focused upon the Buddha, his house became immense, vast, and made of blue beryl.

source: ལྷའི་རིན་པོ་ཆེ་དུ་མས་སྤྲས་པ། དེ་བཞིན་གཤེགས་པས་ཁ་དོག་བསྒྱུར་བ། ལྷ་རྫས་ལས་འདས་པའི་སྤོས་ཀྱིས་ཁྱབ་པར་གྱུར་ཏོ། །
en: It was adorned with many divine jewels, its color transformed by the Tathāgata, and it was pervaded by a perfume that transcended the divine.

source: ཁྱིམ་དེའི་ཕྱོགས་བཞི་ནས། ལྷའི་རིན་པོ་ཆེའི་ཁྲི་བཞི་བྱུང་བར་གྱུར་ཏེ།
en: In the four directions of that house there appeared four thrones made of divine jewels.

source: ཁྲི་དེ་དག་ལས་ཀྱང་ལྷའི་རས་བཅོས་བུ་རིན་པོ་ཆེའི་ཕྲུགས་རྣམས་བཏིང་བ་དག་བྱུང་བར་གྱུར་ཏོ། །
en: The thrones were overspread with layers of precious, divine cloth decorated with divine jewels.

source: ཁྲི་དེ་དག་ལས་ཀྱང་ལྷའི་མེ་ཏོག་པདྨ་རིན་པོ་ཆེ་དུ་མས་སྤྲས་པ། དེ་བཞིན་གཤེགས་པས་ཁ་དོག་བསྒྱུར་བ་དག་བྱུང་ངོ་། །
en: Upon those thrones appeared divine lotus flowers, their colors transformed by the Tathāgata, and adorned by many jewels.

source: པདྨ་དེ་དག་ལས་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞི་བྱུང་བར་གྱུར་ཏོ། །
en: Upon those lotuses there appeared the four buddha bhagavats.

source: ཤར་ཕྱོགས་ནས་ནི་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་བྱུང་།
en: To the east appeared the Tathāgata Akṣobhya.

source: ལྷོ་ཕྱོགས་ནས་ནི་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཏོག་བྱུང་།
en: To the south appeared the Tathāgata Ratnaketu.

source: ནུབ་ཕྱོགས་ནས་ནི་དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་བྱུང་།
en: To the west appeared the Tathāgata Amitābha.

source: བྱང་ཕྱོགས་ནས་ནི་དེ་བཞིན་གཤེགས་པ་རྔ་སྒྲ་བྱུང་སྟེ།
en: To the north appeared the Tathāgata Dundubhisvara.

source: སེང་གེའི་ཁྲི་དེ་དག་ལས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་བྱུང་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །
en: At the moment when those buddha bhagavats appeared upon those lion thrones, the great city of Rājagṛha was filled by a great illuminating light.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བར་དང་། ཕྱོགས་བཅུ་ཀུན་དུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བར་དག་སྣང་བས་ཁྱབ་པར་གྱུར།
en: That light spread throughout the trichiliocosm world realm, throughout as many world realms in the ten directions as there are grains of sand in the Ganges River.

source: ལྷའི་མེ་ཏོག་དག་གི་ཆར་ཡང་བབ།
en: A rain of flowers fell.

source: ལྷའི་སིལ་སྙེན་དག་གི་སྒྲ་ཡང་བྱུང་ངོ་། །
en: There came the sound of divine music.

source: སངས་རྒྱས་ཀྱི་མཐུས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་སེམས་ཅན་ཐམས་ཅད་ཀྱང་ལྷའི་བདེ་བ་དང་ལྡན་པར་གྱུར་ཏེ།
en: Through the power of the Buddha, all beings in this trichiliocosm world realm gained divine happiness.

source: སེམས་ཅན་དབང་པོ་མ་ཚང་བ་རྣམས་ནི། དབང་པོ་ཐམས་ཅད་དང་ལྡན་པར་གྱུར།
en: Those who had incomplete faculties gained all their faculties.

source: སེམས་ཅན་དམུས་ལོང་རྣམས་ནི་མིག་གིས་གཟུགས་རྣམས་མཐོང་། སེམས་ཅན་འོན་པ་དག་གིས་ནི་རྣ་བས་སྒྲ་རྣམས་ཐོས། སེམས་ཅན་སྨྱོན་པ་དག་ནི་དྲན་པ་སོ་སོར་རྙེད། སེམས་ཅན་སེམས་རྣམ་པར་གཡེངས་པ་དག་ནི་སེམས་རྣམ་པར་མི་གཡེང་བར་གྱུར། སེམས་ཅན་སྒྲེན་མོ་རྣམས་ནི་གོས་བགོས་པར་གྱུར། སེམས་ཅན་བཀྲེས་པ་དག་ནི་ལྟོ་འགྲངས་པར་གྱུར། སེམས་ཅན་སྐོམ་པ་རྣམས་ནི་སྐོམ་དང་ཕྲད་པར་གྱུར། སེམས་ཅན་ནད་ཀྱིས་བཏབ་པ་དག་ནི་ནད་དང་བྲལ་བར་གྱུར།
en: The blind saw forms with their eyes; the deaf heard sounds with their ears; the insane gained their sanity; those with distracted minds became undistracted; the naked became clothed; the hungry had their stomachs filled; the thirsty found drink; beings afflicted by illness were healed; and those with impaired physical faculties became possessed of complete faculties.

source: སེམས་ཅན་དབང་པོ་ཉམས་པ་དག་ནི་དབང་པོ་རྣམས་ཚང་བར་གྱུར་ཏེ། འཇིག་རྟེན་དུ་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་རྣམས་རྒྱ་ཆེར་བྱུང་བར་གྱུར་ཏོ། །
en: In those worlds there appeared vast, astonishing, wonderful qualities.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་མཐོང་ནས་ངོ་མཚར་རྨད་དུ་གྱུར་ཏེ། དེ་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ། དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: The bodhisattva Ruciraketu was amazed to see those buddha bhagavats, and, filled with joy, delighted, elated, pleased, and happy, with his palms together in homage, he bowed toward those buddha bhagavats.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་རྣམས་ལས་རྗེས་སུ་དྲན་ལ། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་ཡོན་ཏན་རྗེས་སུ་དྲན་ཞིང་། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད་ལ་ཐེ་ཚོམ་ཟ་བར་གྱུར་ཏེ།
en: Mindful of those buddha bhagavats and mindful of the qualities of the Buddha Bhagavat Śākyamuni, he had doubts concerning the lifespan of the Bhagavat Śākyamuni.

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་འདི་ལྟར་ལོ་བརྒྱད་ཅུ་ཞིག་ཐུབ་སྟེ། སྐུ་ཚེ་ཐུང་བ་འདི་ཇི་ལྟ་བུ་འདི་ཅི་ཞིག་སྙམ་དུ་བསམ་པ་དེ་སེམས་ཤིང་འདུག་པར་གྱུར་ཏོ། །
en: In his mind was the thought, “Why is it that the Bhagavat Śākyamuni has this short lifespan of eighty years?”

source: དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་དགོངས་ཤིང་མཁྱེན་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་ཁྱོད་འདི་སྙམ་དུ། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་འདི་ལྟར་སྐུ་ཚེ་ཐུང་ངོ་སྙམ་དུ་མ་སེམས་ཤིག །
en: Those buddha bhagavats were aware of and understood these thoughts and said to the bodhisattva Ruciraketu, “Noble one, do not think, ‘The Bhagavat Śākyamuni has such a short lifespan.’

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་མ་གཏོགས་པར། ལྷ་དང་བཅས་པ། བདུད་དང་བཅས་པ། ཚངས་པ་དང་བཅས་པ། དགེ་སྦྱོང་དང་།
en: Why is that?

source: བྲམ་ཟེའི་སྐྱེ་དགུ་དང་བཅས་པའི་འཇིག་རྟེན་ན། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད་ཀྱི་མཐའ། ཕྱི་མའི་མཐའི་མུའི་བར་དུ་ཡང་རྟོགས་པར་ནུས་པ་ངེད་ཀྱིས་སུ་ཡང་མ་མཐོང་ངོ་། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་བཤད་པ་བརྗོད་མ་ཐག་ཏུ་དེ་ནས་དེའི་མོད་ལ་སངས་རྒྱས་ཀྱི་མཐུས། ལྷའི་བུ་འདོད་པ་ན་སྤྱོད་པ་རྣམས་དང་། གཟུགས་ན་སྤྱོད་པ་རྣམས་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་།
en: Noble one, except for the tathāgata arhat samyaksaṃbuddhas, we do not see anyone within the world with its devas, with its Māra, with its Brahmā, with its many beings who are mendicants and brahmins, and with its devas, humans, and asuras who has the ability to know the Bhagavat Tathāgata Śākyamuni’s lifespan to its future limit.”

source: ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་བར་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་འདུས་ནས།
en: As soon as those buddha bhagavats described the Tathāgata’s lifespan, at that moment, through the power of the buddhas, the devas in the desire realm, the devas in the form realm, the nāgas, the yakṣas, the gandharvas, the asuras, the garuḍas, the kinnaras, the mahoragas, and the many hundreds of thousands of quintillions of assembled bodhisattvas arrived in the house of the bodhisattva Ruciraketu.

source: བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་གི་ཁྱིམ་དེར་ལྷགས་སོ། །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ལ་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད་བཤད་པའི་ཚིགས་སུ་བཅད་དེ་མདོར་བཀའ་སྩལ་པ། །རྒྱ་མཚོའི་ཆུ་རྣམས་ཐམས་ཅད་ཀྱི། །ཐིགས་པ་དག་ནི་བགྲང་བར་ནུས། །
en: Those tathāgatas then recited verses that taught in brief the length of the lifespan of the Bhagavat Śākyamuni to that complete assembly: “The drops of water in all The oceans can be calculated, But no one can calculate The lifespan of Śākyamuni.

source: ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད། །སུས་ཀྱང་བགྲང་བར་མི་ནུས་སོ། །རི་རབ་རྣམས་ནི་ཐམས་ཅད་ཀྱང་། །ཕྲ་རབ་རྡུལ་བརླགས་བགྲང་བར་ནུས། །ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད། །
en: “If all Sumerus were reduced to atoms, Their number could be calculated, But no one can calculate The lifespan of Śākyamuni.

source: སུས་ཀྱང་བགྲང་བར་མི་ནུས་སོ། །ས་ལ་གང་དག་ཡོད་པ་ཡི། །རབ་ཏུ་ཕྲ་རྡུལ་ཇི་སྙེད་པ། །ཐམས་ཅད་བགྲང་བར་ནུས་སྲིད་ཀྱི། །རྒྱལ་བའི་སྐུ་ཚེའི་ཚད་མི་ནུས། །
en: “Someone might calculate The number of atoms in the earth, But no one can calculate The entire lifespan of the Jina.

source: གལ་ཏེ་ལ་ལས་ནམ་མཁའ་ལ། །སྣ་འགའ་ཞིག་གིས་དཔག་འདོད་ཀྱང་། །ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད། །སུས་ཀྱང་བགྲང་བར་མི་ནུས་སོ། །རྫོགས་པའི་སངས་རྒྱས་འདི་སྲིད་བཞུགས། །བསྐལ་པ་དག་ནི་དེ་སྙེད་ཅིག །
en: “Someone might calculate The extent of space, But no one can calculate The lifespan of Śākyamuni.

source: བསྐལ་པ་བྱེ་བ་བརྒྱ་དག་ཅེས། །གྲངས་ནི་རྙེད་པར་མི་རུང་ངོ་། །གང་ཕྱིར་དེ་ཡི་བྱེད་རྒྱུ་གཉིས། །རྒྱུ་ཡང་རྣམ་པ་གཉིས་གསུངས་ཏེ། །གཞན་ལ་འཚེ་བ་སྤངས་པ་དང་། །ཁ་ཟས་མང་པོ་བྱིན་པ་སྟེ། །
en: “One cannot reach a number By saying that the perfect Buddha Will remain for this number of eons, Or for a hundred million eons, “This is because of two causes And because of two conditions: He has forsaken violence toward others, And he has given food numerous times.

source: དེ་ཕྱིར་བདག་ཉིད་ཆེན་པོ་དེའི། །སྐུ་ཚེའི་ཚད་གྲངས་མི་རྙེད་དེ། །བསྐལ་པ་འདི་སྙེད་ཅིག་ཅེ་འམ། །གྲངས་མེད་པ་ཡང་དེ་བཞིན་ཏེ། །
en: “Therefore, the length of the great being’s Lifespan cannot be calculated By saying it is a certain number of eons, Or likewise by saying it is countless eons.

source: དེ་བས་ཐེ་ཙོམ་མེད་པར་འགྱུར། །ཐེ་ཙོམ་ཅུང་ཟད་མ་ཟ་ཤིག །
en: “Therefore, do not doubt, do not have any doubt whatsoever.

source: རྒྱལ་བའི་སྐུ་ཚེའི་ཐ་མ་ཡི། །གྲངས་ནི་གང་དུའང་མི་དམིགས་སོ། །
en: No one can conceive of the final extent of a jina’s lifespan.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་གིས། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད་བཤད་པ་དེ་ཐོས་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ཇི་ལྟར་ན་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེ་བཞིན་གཤེགས་པས། དེ་ལྟར་སྐུ་ཚེའི་ཚད་ཐུང་བར་བསྟན་པར་གྱུར་ཅེས་དེ་སྐད་ཅེས་གསོལ་བ་དང་།
en: Then the bodhisattva Ruciraketu, having heard that teaching on the lifespan of Bhagavat Śākyamuni, asked those bhagavats, “Why is it that the Bhagavat Śākyamuni, the Tathāgata, manifests such a short lifespan?”

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས། བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེ་བཞིན་གཤེགས་པ་དེ་ནི་སྙིགས་མ་རྣམ་པ་ལྔའི་འཇིག་རྟེན་དུ་སྐྱེ་དགུའི་ཚེའི་ཚད་ལོ་བརྒྱ་ཐུབ་པའི་དུས་སུ་བལྟམས་ནས།
en: The bhagavats said to the bodhisattva Ruciraketu, “The Bhagavat Śākyamuni, the Tathāgata, has been born at a time when beings could live for a hundred years in a world that has the five degenerations.

source: སེམས་ཅན་མོས་པ་དམན་པ། དགེ་བའི་རྩ་བ་དང་། དད་པ་ཆུང་བའི་སེམས་ཅན་དེ་དག་བདག་ཏུ་ལྟ་བ་དང་། སེམས་ཅན་དུ་ལྟ་བ་དང་། སྲོག་ཏུ་ལྟ་བ་དང་། གསོ་བར་ལྟ་བ་དང་། གང་ཟག་ཏུ་ལྟ་བ་དང་། ལོག་པར་ལྟ་བ་དང་། བདག་དང་བདག་གིར་འཛིན་པ་དག་དང་། རྟག་པ་དང་ཆད་པར་ལྟ་བ་ལ་སོགས་པའི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ལ་ཕན་གདགས་པ་དང་།
en: Therefore, the Tathāgata Śākyamuni has manifested a short lifespan in order to benefit beings with inferior aspiration, beings with little roots of merit and faith, and ordinary foolish beings who have the view that there is a being, the view that there is a soul, the view that there is a spirit, the view that there is an individual, erroneous views, the belief in ‘me’ and ‘mine,’ the views of eternalism and nihilism, and so on.

source: གཞན་ཡང་མུ་སྟེགས་ཅན་རྣམས་ལ་ཡང་དག་པའི་ལྟ་བ་བསྐྱེད་པས་མྱུར་དུ་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཐོབ་པར་བྱ་བའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་སྐུ་ཚེའི་ཚད་ཐུང་བ་བསྟན་ཏོ། །
en: It is also to inspire the true view in tīrthikas so that they will quickly attain the highest enlightenment.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དེ་མྱ་ངན་ལས་འདའ་བ་བསྟན་པས། སེམས་ཅན་རྣམས་དེ་ལ་དཀོན་པ་དང་ཕྲད་པར་དཀའ་བའི་འདུ་ཤེས་དང་། མྱ་ངན་དང་། སྡུག་བསྔལ་གྱི་འདུ་ཤེས་ལ་སོགས་པ་བསྐྱེད་པས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་མདོ་འདི་དག་མྱུར་དུ་འཛིན་པ་དང་།
en: “Moreover, noble one, the Tathāgata, by manifesting passing into nirvāṇa, causes beings to perceive him as rare and difficult to meet; causes them to perceive misery, suffering, and so on; and inspires them to quickly obtain, possess, read, comprehend, and teach widely to others these sūtras that have been taught by the Buddha Bhagavat, and to not malign them.

source: འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་པ་ལ་སྐུར་པ་འདེབས་པ་མེད་པར་འགྱུར་བས། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པས་སྐུ་ཚེ་ཐུང་བར་བསྟན་ཏོ། །
en: That is why the Tathāgata manifests a short lifespan.

source: དེ་ཡང་དེ་བཞིན་གཤེགས་པ་རྟག་ཏུ་བཞུགས་ཤིང་མྱ་ངན་ལས་མི་འདའ་ན། སེམས་ཅན་རྣམས་གུས་པ་མེད་པ་དང་། ཕྲད་པར་དཀའ་བའི་འདུ་ཤེས་ཀྱང་མི་སྐྱེད་པས། དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་མདོ་ཟབ་མོ་དག་འཛིན་ཅིང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་པར་མི་བྱེད་དོ། །
en: If the Tathāgata were always present and did not pass into nirvāṇa, beings would have no reverence—they would not perceive him as being difficult to meet, and they would not obtain, possess, read, comprehend, and teach widely to others these sūtras that have been taught by the Tathāgata.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: དེ་ནི་བཅོམ་ལྡན་འདས་རྟག་ཏུ་འཇིག་རྟེན་ན་བཞུགས་པར་འཛིན་པའི་ཕྱིར་རོ། །
en: Because they would believe that the Bhagavat would always remain in the world.

source: རིགས་ཀྱི་བུ་དཔེར་ན། གང་ལ་ལ་ཞིག་ཕ་མ་ལ་ནོར་བུ་རིན་པོ་ཆེ་རྒྱས་པ་མང་དུ་ཡོད་པ་མཐོང་ན། ནོར་དེ་ལ་དཀོན་པ་དང་། ངོ་མཚར་གྱི་འདུ་ཤེས་མི་སྐྱེད་དོ། །
en: “As an analogy, noble one, someone who sees that his parents have many precious jewels would not perceive that wealth as being rare or wonderful.

source: ཕ་མའི་ནོར་རྫས་དེ་ལ་རྟག་ཏུ་ཡོད་པའི་འདུ་ཤེས་སྐྱེ་བའི་ཕྱིར་རོ། །
en: It is because he perceives that his parents’ wealth will always be present.

source: དེ་བཞིན་དུ་བཅོམ་ལྡན་འདས་རྟག་ཏུ་མྱ་ངན་ལས་མི་འདའ་ན། དེ་ལ་དཀོན་པ་དང་། ཕྲད་པར་དཀའ་བའི་འདུ་ཤེས་མི་འབྱུང་བའི་ཕྱིར་རོ། །
en: In the same way, if the Bhagavat never passed into nirvāṇa, he would not be perceived as rare and difficult to meet.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དཔེར་ན་གང་ལ་ལ་ཞིག་ཕ་མ་དབུལ་ཞིང་ནོར་དང་མི་ལྡན་པ་ཞིག་དེ་རྒྱལ་པོའམ། བློན་པོ་ཆེན་པོ་ཞིག་གི་གནས་སུ་ཕྱིན་ཏེ། དེ་དག་གི་བང་མཛོད་དང་། ནོར་དང་། རིན་པོ་ཆེ་ལ་སོགས་པ་མང་པོ་རྒྱས་པ་མཐོང་ན། དེ་དཀོན་པ་དང་། རྙེད་པར་དཀའ་བའི་འདུ་ཤེས་སྐྱེ་སྟེ། དབུལ་པོ་དེ་ནོར་བཙལ་བའི་ཐབས་བསྒྲུབ་པ་ལ་བརྩོན་པར་བྱེད་དོ། །དེ་ནི་དབུལ་བ་དང་ཕོངས་པ་སྤངས་ཏེ། བདེ་བ་དང་འབྱོར་པ་བསྒྲུབ་པར་འདོད་པའི་ཕྱིར་རོ། །
en: “Moreover, noble one, as another analogy, if someone who had poor parents, who had no wealth, went to the dwelling of a king or great minister and saw their vast, numerous treasuries, wealth, jewels and so on, he would perceive them as rare and difficult to obtain, and he would dedicate himself to accomplishing the methods for seeking wealth, because he would wish to leave poverty behind and to accomplish happiness and prosperity.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ལས་འདའ་བ་མཐོང་ན། དེ་དཀོན་པ་དང་། ཕྲད་པར་དཀའ་བ་དང་། མྱ་ངན་དང་སྡུག་བསྔལ་གྱི་འདུ་ཤེས་ཀྱང་སྐྱེད་ཅིང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དུ་འབྱུང་བ་ཡང་། བསྐལ་པ་གྲངས་མེད་པ་ན་ལན་འགའ་ཞིག་འབྱུང་སྟེ།
en: “In the same way, noble one, if the Tathāgata is seen to pass into nirvāṇa, there will be the perception of how rare and difficult he is to meet, and the perception of misery and suffering.

source: ཇི་ལྟར་མེ་ཏོག་ཨུ་དུམ་བཱ་ར་བརྒྱ་ལམ་ན་ལན་འགའ་ཞིག་འབྱུང་བ་བཞིན་པས། སེམས་ཅན་རྣམས་དེ་ལ་དཀོན་པ་དང་ཕྲད་པར་དཀའ་བའི་འདུ་ཤེས་བསྐྱེད་ཅིང་། བཅོམ་ལྡན་འདས་དེ་ལ་གུས་པ་སྐྱེ་བར་འགྱུར། ཞལ་ནས་གསུངས་པའི་མདོ་རྣམས་ལ་ཡང་བདེན་པའི་འདུ་ཤེས་དང་། ཡོངས་སུ་གཟུང་བའི་འདུ་ཤེས་བསྐྱེད་ཅིང་སྐུར་པ་འདེབས་པར་མི་བྱེད་དོ། །
en: The Bhagavat Tathāgata only appears a few times in countless eons, just as a fig tree flower hardly ever appears, just a few times, so that beings will perceive him as rare and difficult to meet, and they will have veneration for him, perceive the sūtras he teaches to be the truth, and perceive them as something to be possessed and not to be maligned.

source: རིགས་ཀྱི་བུ་དེ་ལྟ་བས་ན། དེ་བཞིན་གཤེགས་པ་རྒྱུ་དེ་དང་རྐྱེན་དེའི་ཕྱིར། འཇིག་རྟེན་ན་ཡུན་རིང་དུ་མི་བཞུགས་ཤིང་མྱུར་དུ་མྱ་ངན་ལས་འདའ་བར་མཛད་པས།
en: “Therefore, noble one, because of those causes and conditions, the Tathāgata does not remain long in the world but quickly passes into nirvāṇa.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་ཐབས་མཁས་པ་ཕུན་སུམ་ཚོགས་པ་དེ་ལྟ་བུས། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་མཛད་དོ། །
en: It is through such a perfection of skillful methods that the tathāgatas ripen beings.”

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་བཞི་པོ་དེ་དག་ཀྱང་མི་སྣང་བར་གྱུར་ཏོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཛེས་པའི་ཏོག་དང་།
en: Then those four tathāgatas vanished.

source: བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་ཚད་མེད་པ་དང་། གཞན་ཡང་སྲོག་ཆགས་བྱེ་བ་བརྒྱ་སྟོང་ཚད་མེད་པ་དང་། ཐབས་ཅིག་ཏུ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ག་ལ་བ་དེར་སོང་སྟེ།
en: Then the bodhisattva Ruciraketu, the countless hundreds of thousands of bodhisattvas, and the countless trillions of beings went together to Vulture Peak Mountain.

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེ་བཞིན་གཤེགས་པའི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: They bowed their heads to the feet of the Bhagavat Śākyamuni, the Tathāgata, and seated themselves.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་གིས་ཇི་ལྟར་གྱུར་པ་དེ་དག་གསོལ་ནས། དེ་ནས་དེ་བཞིན་གཤེགས་པ་དེ་བཞི་ཡང་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་བཞུགས་པར་བྱོན་ནས། ཕྱོགས་སོ་སོའི་གདན་གྱི་སྟེང་ན་བཞུགས་ཏེ། འཁོར་གྱི་བྱང་ཆུབ་སེམས་དཔའ་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་སོང་ལ། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་གནོད་པ་དང་། ཉམ་ང་བ་ཆུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། བདེ་བ་ལ་རེག་པར་གནས་སམ་ཞེས་གསོལ་ཅིག །གཞན་ཡང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ།
en: The bodhisattva Ruciraketu described what had occurred, and those four tathāgatas came to where the Bhagavat Śākyamuni was dwelling on Vulture Peak Mountain, sat upon the thrones in their own directions, and addressed their entourages of bodhisattvas: “Noble ones, go and ask the Bhagavat Śākyamuni, ‘Are you unharmed, unafraid, undisturbed, and feeling happy?’

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོ་ཤིན་ཏུ་ཟབ་པ་འདི། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། མུ་གེའི་ཡ་ང་བ་ཡོངས་སུ་བསལ་ཏེ། ཐམས་ཅད་བདེ་བ་དང་ལྡན་པའི་ཕྱིར་འདི་བསྟན་པ་ལེགས་ཏེ། རྗེས་སུ་དགྱེས་པར་མཛད་དོ་ཞེས་ཀྱང་གསོལ་ཅིག །
en: Also make this request to the Bhagavat Tathāgata Śākyamuni: ‘If you were to teach this very profound lord of sūtras, The Sūtra of the Sublime Golden Light, for the benefit of beings, to dispel the distress of famine, and to bring happiness to all, that would be excellent and would bring joy!’ ”

source: དེ་ནས་སོ་སོའི་ཞམ་རིང་ནས་མཆིས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་བཞི་པོ་དེ་དག་གིས་ཇི་སྐད་བཀའ་སྩལ་པ་དེ་བཞིན་དུ་གསོལ་ཏོ། །
en: The bodhisattvas who were their attendants went toward the Bhagavat Śākyamuni, and, having approached him, bowed their heads down to his feet, and they made the request that the four tathāgatas had instructed.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས།
en: Then the Bhagavat Śākyamuni, the tathāgata, the arhat samyaksaṃbuddha, said, “Well done!”

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་ལེགས་སོ་ཞེས་བཀའ་སྩལ་ཏེ།
en: to those bodhisattvas. “Well done!

source: ལེགས་སོ་ལེགས་སོ། །
en: Well done!”

source: དེ་བཞིན་གཤེགས་པ་བཞིས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བའི་དོན་དུ་དམ་པའི་ཆོས་འདི་བཤད་པར་ང་ལ་བསྐུལ་བ་མཛད་པས། དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །བྱ་རྒོད་ཕུང་པོའི་རི་ལ་ང་བཞུགས་ཏེ། །མདོ་སྡེ་རིན་ཆེན་འདི་ནི་འཆད་མཛད་ཀྱང་། །སྐྱེ་བོ་མང་པོ་འདི་དག་བསྒྲལ་བའི་ཕྱིར། །ཡོངས་སུ་མྱ་ངན་འདའ་བའང་སྟོན་པ་མཛད། །
en: At that time, because the four tathāgatas had invoked him to teach this sublime Dharma in order to bring benefit and happiness to all beings, the Bhagavat recited these verses: “I dwell upon Vulture Peak Mountain Where I teach this precious sūtra, But in order to liberate these many beings, I will also manifest passing into nirvāṇa.

source: བྱིས་པ་ལྟ་བ་ལོག་པར་གྱུར་པ་རྣམས། །ང་ཡི་བསྟན་ལ་མོས་པར་མི་བྱེད་པ། །དེ་དག་ཀུན་དུ་བསྒྲལ་བའི་དོན་གྱི་ཕྱིར། །ཡོངས་སུ་མྱ་ངན་འདའ་བའང་སྟོན་མཛད་དོ། །དེ་ནས་དེའི་ཚེ།
en: “The foolish with incorrect views Will not aspire to my teachings, So in order to liberate them all, I will manifest passing into nirvāṇa.”

source: འཁོར་དེར་སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱ་ཞེས་བྱ་བ་དང་། བྲམ་ཟེ་སྟོང་ཕྲག་དུ་མས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོའི་སྒྲ་ཐོས་ནས། འཕྲལ་དུ་ངུས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་གཏུགས་ནས། བཅོམ་ལྡན་འདས་ལ་གསོལ་པ།
en: At that time, in that assembly, there was the Kauṇḍinya brahmin, the Dharma master Vyākaraṇa, who, together with countless thousands of brahmins, had made offerings to the Bhagavat.
